# Диаграмма вариантов использования

![Диаграмма вариантов использования](https://github.com/GaponTV/AnonChatVK/blob/master/Images/Diagrams/UseCase.png)

# Содержание

1. [Актёры](#1) <br>
2. [Варианты использования](#2) <br>
    2.1. [Начать поиск собеседника](#2.1) <br>
      2.1.1 [Общение с собеседником](#2.1.1) <br>
      2.1.2 [Найти другого собеседника](#2.1.2) <br>
      2.1.3 [Завершить общение с собеседником](#2.1.3) <br>
    
        
 <a name="1"/>
 
 # 1 Актёры
 
| Актёр | Описание |
|:--|:--|
| Пользователь | Человек, который может использовать весь функционал приложения |
| Собеседник | Другой пользователь |

<a name="2"/>

# 2 Варианты использования

<a name="2.1"/>

## 2.1 Начать поиск собеседника

<a name="2.1.1"/>

### 2.1.1 Общение с собеседником
1. Перед пользователем показываете сообщение о том, что поиск собеседника успешно начался.<br>
2. Пользователь дожидается сообщения о том, что собеседник найден.<br>
3. Общается с собеседником.
4. Вариант использования завершается.

<a name="2.1.2"/>

### 2.1.2 Найти другого собеседника
1. Пользователь нажимает клавишу "Следующий собеседник".
2. Вариант использования завершается.

<a name="2.1.3"/>

### 2.1.3 Завершить общение с собеседником
1. Пользователь нажимает клавишу "Завершить". 
2. Вариант использования завершается
